ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/rstctl.xml
<module id="RSTCTL" HW_revision=""><register id="RESET_REQ" width="32" offset="0x0" internal="0" description="Reset Request Register"><bitfield id="SOFT_REQ" description="If written with 1, generates a Soft Reset request to the Reset " begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="HARD_REQ" description="If written with 1, generates a Hard Reset request to the Reset " begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="RSTKEY" description="Must be written with 69h to enable writes to bits 1-0 (in the s" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="HARDRESET_STAT" width="32" offset="0x4" internal="0" description="Hard Reset Status Register"><bitfield id="SRC0" description="If 1, indicates that SRC0 was the source of the Hard Reset" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="If 1, indicates that SRC1 was the source of the Hard Reset" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="If 1, indicates that SRC2 was the source of the Hard Reset" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="If 1, indicates that SRC3 was the source of the Hard Reset" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="If 1, indicates that SRC4 was the source of the Hard Reset" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="If 1, indicates that SRC5 was the source of the Hard Reset" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="If 1, indicates that SRC6 was the source of the Hard Reset" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="If 1, indicates that SRC7 was the source of the Hard Reset" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="If 1, indicates that SRC8 was the source of the Hard Reset" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="If 1, indicates that SRC9 was the source of the Hard Reset" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="If 1, indicates that SRC10 was the source of the Hard Reset" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="If 1, indicates that SRC11 was the source of the Hard Reset" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="If 1, indicates that SRC12 was the source of the Hard Reset" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="If 1, indicates that SRC13 was the source of the Hard Reset" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="If 1, indicates that SRC14 was the source of the Hard Reset" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="If 1, indicates that SRC15 was the source of the Hard Reset" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="HARDRESET_CLR" width="32" offset="0x8" internal="0" description="Hard Reset Status Clear Register"><bitfield id="SRC0" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="Write 1 clears the corresponding bit in the RSTCTL_HARDRESET_ST" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="HARDRESET_SET" width="32" offset="0xC" internal="0" description="Hard Reset Status Set Register"><bitfield id="SRC0" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="Write 1 sets the corresponding bit in the RSTCTL_HARDRESET_STAT" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="SOFTRESET_STAT" width="32" offset="0x10" internal="0" description="Soft Reset Status Register"><bitfield id="SRC0" description="If 1, indicates that SRC0 was the source of the Soft Reset" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="If 1, indicates that SRC1 was the source of the Soft Reset" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="If 1, indicates that SRC2 was the source of the Soft Reset" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="If 1, indicates that SRC3 was the source of the Soft Reset" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="If 1, indicates that SRC4 was the source of the Soft Reset" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="If 1, indicates that SRC5 was the source of the Soft Reset" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="If 1, indicates that SRC6 was the source of the Soft Reset" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="If 1, indicates that SRC7 was the source of the Soft Reset" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="If 1, indicates that SRC8 was the source of the Soft Reset" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="If 1, indicates that SRC9 was the source of the Soft Reset" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="If 1, indicates that SRC10 was the source of the Soft Reset" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="If 1, indicates that SRC11 was the source of the Soft Reset" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="If 1, indicates that SRC12 was the source of the Soft Reset" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="If 1, indicates that SRC13 was the source of the Soft Reset" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="If 1, indicates that SRC14 was the source of the Soft Reset" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="If 1, indicates that SRC15 was the source of the Soft Reset" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="SOFTRESET_CLR" width="32" offset="0x14" internal="0" description="Soft Reset Status Clear Register"><bitfield id="SRC0" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="Write 1 clears the corresponding bit in the RSTCTL_SOFTRESET_ST" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="SOFTRESET_SET" width="32" offset="0x18" internal="0" description="Soft Reset Status Set Register"><bitfield id="SRC0" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SRC1" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SRC2" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="SRC3" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="SRC4" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="SRC5" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="SRC6" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="SRC7" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="SRC8" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="SRC9" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="SRC10" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SRC11" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="SRC12" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="SRC13" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="SRC14" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="SRC15" description="Write 1 sets the corresponding bit in the RSTCTL_SOFTRESET_STAT" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="PSSRESET_STAT" width="32" offset="0x100" internal="0" description="PSS Reset Status Register"><bitfield id="SVSL" description="Indicates if POR was caused by an SVSL trip condition in the PS" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SVSMH" description="Indicates if POR was caused by an SVSMH trip condition int the " begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="BGREF" description="Indicates if POR was caused by a BGREF not okay condition in th" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="VCCDET" description="Indicates if POR was caused by a VCCDET trip condition in the P" begin="3" end="3" width="1" rwaccess="R/W"/></register><register id="PSSRESET_CLR" width="32" offset="0x104" internal="0" description="PSS Reset Status Clear Register"><bitfield id="CLR" description="Write 1 clears all PSS Reset Flags in the RSTCTL_PSSRESET_STAT" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="PCMRESET_STAT" width="32" offset="0x108" internal="0" description="PCM Reset Status Register"><bitfield id="LPM35" description="Indicates if POR was caused by PCM due to an exit from LPM3.5" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="LPM45" description="Indicates if POR was caused by PCM due to an exit from LPM4.5" begin="1" end="1" width="1" rwaccess="R/W"/></register><register id="PCMRESET_CLR" width="32" offset="0x10C" internal="0" description="PCM Reset Status Clear Register"><bitfield id="CLR" description="Write 1 clears all PCM Reset Flags in the RSTCTL_PCMRESET_STAT" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="PINRESET_STAT" width="32" offset="0x110" internal="0" description="Pin Reset Status Register"><bitfield id="RSTNMI" description="Indicates if POR was caused by RSTn/NMI pin based reset event i" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="PINRESET_CLR" width="32" offset="0x114" internal="0" description="Pin Reset Status Clear Register"><bitfield id="CLR" description="Write 1 clears the RSTn/NMI Pin Reset Flag in RSTCTL_PINRESET_S" begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="REBOOTRESET_STAT" width="32" offset="0x118" internal="0" description="Reboot Reset Status Register"><bitfield id="REBOOT" description="Indicates if Reboot reset was caused by the SYSCTL module." begin="0" end="0" width="1" rwaccess="R/W"/></register><register id="REBOOTRESET_CLR" width="32" offset="0x11C" internal="0" description="Reboot Reset Status Clear Register"><bitfield id="CLR" description="Write 1 clears the Reboot Reset Flag in RSTCTL_REBOOTRESET_STAT" begin="0" end="0" width="1" rwaccess="R/W"/></register></module>